{
  "backend/main.mo": "Main Motoko actor for The Swad Restaurant backend, defining data types (Dish, Order, Reservation, Review, Coupon, UserProfile) and CRUD endpoints for dishes, orders, reservations, reviews, coupons, and user profiles, with admin-only guards via AccessControl.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (visual theme, splash screen, home screen, menu screen, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing short summaries of three frontend files: App.tsx (router/providers setup), Admin.tsx (admin panel), and index.css (global brand theme styles).",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom property tokens for light and dark color modes used by shadcn-ui components, plus base border and background body styles.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'The Swad Restaurant' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Main React application file that configures TanStack Router with all page routes, wraps the app in CartProvider and ThemeProvider, renders a Navbar layout with ProfileSetupModal, and includes a branded multi-column footer.",
  "frontend/src/components/DishCard.tsx": "Reusable dish card component that displays a dish image with category fallbacks, veg/non-veg indicator, price, availability overlay, and add-to-cart button with inline quantity increment/decrement controls.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component using Internet Identity authentication, showing loading state during login and toggling between login and logout actions with branded maroon styling.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with links to main pages, a cart icon with item count badge, admin link for admin users, and a mobile hamburger menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly logged-in user to enter their name and optional delivery address to complete profile setup.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating component that supports display-only and interactive modes with configurable size and max stars.",
  "frontend/src/context/CartContext.tsx": "React context providing cart state management including add/remove/update item operations, coupon/discount application, and computed totals.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication using DFINITY's AuthClient, exposing identity, login/logout functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping all backend actor calls for dishes, orders, reservations, reviews, user profiles, coupons, and admin operations.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Playfair Display, Lato), sets up Tailwind directives, and defines CSS custom properties for light/dark theme tokens plus utility classes for gradients, card hover effects, and food type indicators.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with tabs for managing dishes (add/edit/delete), orders (status updates), and coupons, gated behind admin role check and Internet Identity authentication.",
  "frontend/src/pages/BookTable.tsx": "Table reservation page with a form for name, phone, date, time slot, and guest count that submits to the backend via useMakeReservation and shows a confirmation screen on success.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with quantity controls, coupon validation, payment method selection, and order placement, showing a confirmation screen after a successful order.",
  "frontend/src/pages/Contact.tsx": "Static contact page displaying the restaurant's address, opening hours, and contact buttons (phone, WhatsApp, email) alongside a Google Maps embed link.",
  "frontend/src/pages/Home.tsx": "Home page component displaying a hero banner, quick action buttons, special offers, and a grid of today's featured dishes fetched from the API.",
  "frontend/src/pages/Menu.tsx": "Menu page that fetches all dishes and renders them in category tabs with veg/non-veg filter toggles and loading skeletons.",
  "frontend/src/pages/Profile.tsx": "User profile page with tabs for profile info, order history, and reservations; requires Internet Identity login and supports inline profile editing.",
  "frontend/src/pages/Reviews.tsx": "Reviews page that displays all customer reviews with an average star rating and a form for authenticated users to submit new reviews.",
  "frontend/src/pages/SplashScreen.tsx": "Animated splash screen shown on app launch that fades out after 2 seconds and navigates to the home route.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining a warm Indian-themed color palette (saffron, maroon, gold, cream) with custom fonts, shadows, border radii, and keyframe animations using typography, container-queries, and animate plugins.",
  "project_state.json": "Project state descriptor for 'The Swad Restaurant' mobile app, documenting architectural notes, required images, and a list of existing implemented features across splash screen, home, menu, cart, and ordering flows."
}