{
  "kind": "build_request",
  "title": "The Swad Restaurant – Full-Stack Restaurant App",
  "projectName": "The Swad Restaurant",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a premium warm-color visual theme throughout the app using saffron (#F28C28), maroon (#800000), and gold (#FFD700) as primary brand colors. Use rich dark backgrounds for contrast, elegant serif or semi-serif typography for headings, and subtle texture or pattern accents inspired by Indian motifs. Ensure consistent spacing, smooth transitions, and a clean layout that feels premium and easy to navigate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "warm colors like saffron, maroon, and gold",
          "premium, clean, and easy to navigate",
          "smooth animations and simple navigation"
        ]
      },
      "acceptanceCriteria": [
        "Saffron, maroon, and gold are used as the dominant palette across all screens",
        "Typography is elegant and consistent across headings and body text",
        "All transitions and page changes have smooth animations",
        "Layout is responsive and usable on both mobile and desktop viewports"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create a Splash Screen as the initial landing view that displays the restaurant logo image, the restaurant name 'The Swad Restaurant', and the tagline 'Experience the True Taste of Swad'. The screen should auto-dismiss after ~2.5 seconds and navigate to the Home screen with a fade-out animation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Splash Screen",
          "Logo of The Swad Restaurant",
          "Tagline: 'Experience the True Taste of Swad'"
        ]
      },
      "acceptanceCriteria": [
        "Splash screen is shown on first load",
        "Logo, restaurant name, and tagline are all visible",
        "Screen fades out after ~2.5 seconds and transitions to Home"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build a Home screen that displays: (1) a hero banner section with a featured dish image and a welcome message, (2) a 'Today's Special / Special Offers' horizontal scroll section with dish cards, (3) three prominent quick-action buttons: 'Order Now', 'Book Table', and 'View Menu', each navigating to their respective sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Featured dishes with images",
          "Special offers / Today's special",
          "Quick buttons: Order Now, Book Table, View Menu"
        ]
      },
      "acceptanceCriteria": [
        "Hero banner with featured dish image is visible",
        "Today's Special section renders scrollable dish cards",
        "Order Now, Book Table, and View Menu buttons navigate to the correct pages"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Store featured dishes and today's specials in the backend. Each dish record must include: name, description, price, category (Starters, Main Course, Breads, Desserts, Beverages), image URL, veg/non-veg flag, and availability status. Expose query functions to retrieve all dishes, filter by category, and filter by veg/non-veg.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Menu Section",
          "Categories: Starters, Main Course, Breads, Desserts, Beverages",
          "Veg & Non-Veg filter option",
          "Item name, description, price, and image"
        ]
      },
      "acceptanceCriteria": [
        "Dishes can be stored with all required fields",
        "Query returns dishes filtered by category",
        "Query returns dishes filtered by veg/non-veg flag",
        "Dishes are seeded with sample data for all five categories"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Build a Menu screen with tab-based category navigation (Starters, Main Course, Breads, Desserts, Beverages) and a Veg / Non-Veg toggle filter. Each menu item card must display the dish image, name, description, price, a veg/non-veg indicator dot (green/red), and an 'Add to Cart' button with quantity controls (+ / -).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Menu Section",
          "Veg & Non-Veg filter option",
          "Item name, description, price, and image",
          "Add to Cart option"
        ]
      },
      "acceptanceCriteria": [
        "All five category tabs are visible and switch the displayed items",
        "Veg/Non-Veg filter correctly hides/shows items",
        "Each card shows image, name, description, price, and dietary indicator",
        "Add to Cart button adds the item to the cart and shows quantity controls"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement a persistent shopping cart (stored in frontend React state / local context). The Cart screen must display all added items with names, quantities, prices, and a subtotal. Users must be able to: adjust item quantities, remove items, enter a coupon code (validated against backend), and see the final total. Provide placeholder payment method selection: UPI, Card, and Cash on Delivery. On order confirmation, save the order to the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Shopping cart",
          "Quantity selection",
          "Apply coupon code",
          "Multiple payment options (UPI, Card, Cash on Delivery)"
        ]
      },
      "acceptanceCriteria": [
        "Cart persists across navigation within the session",
        "Quantity can be increased or decreased per item",
        "Coupon code field is present and validates against backend coupons",
        "Payment method selector shows UPI, Card, and Cash on Delivery options",
        "Placing order saves order record to backend and clears cart"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Store orders and coupon codes in the backend. An order record must include: items (name, quantity, price), total amount, payment method, user reference, order status (Pending, Confirmed, Preparing, Delivered), and timestamp. Coupon records must include a code string and discount percentage. Expose update functions for order status.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Online Ordering System",
          "Apply coupon code",
          "Manage orders"
        ]
      },
      "acceptanceCriteria": [
        "Orders are stored with all required fields",
        "Coupons can be created and queried by code string",
        "Order status can be updated via a backend call",
        "Sample coupon codes are seeded (e.g., SWAD10 for 10% off)"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Build a Table Reservation screen with a booking form containing fields: Name, Phone Number, Date, Time, and Number of Guests. On submission, save the reservation to the backend and show a confirmation message. Display existing reservations in the user's account section.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Table Reservation",
          "Booking form (Name, Phone, Date, Time, Number of Guests)"
        ]
      },
      "acceptanceCriteria": [
        "Form has all five required fields with validation",
        "Submitted reservation is saved to the backend",
        "Confirmation message is displayed after successful booking",
        "Reservations are retrievable per user"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Implement user account functionality using Internet Identity for authentication. After login, show the user's profile page with: order history (list of past orders with status), saved delivery addresses (add/remove), and table reservation history. Guest users can browse and add to cart but must log in before placing an order.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "User Account Section",
          "Login / Sign Up",
          "Order history",
          "Saved addresses"
        ]
      },
      "acceptanceCriteria": [
        "Internet Identity login flow works and returns a principal",
        "Order history lists past orders with name, date, total, and status",
        "User can add and remove saved delivery addresses",
        "Unauthenticated users are prompted to log in before checkout"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Build a Reviews & Ratings screen where authenticated users can submit a star rating (1–5) and a text review for their dining/ordering experience. Display all reviews in a list with reviewer name (or anonymous), rating stars, review text, and date. Store reviews in the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Reviews & Ratings",
          "Customers can give feedback and ratings"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated users can submit a rating and review",
        "Reviews are saved to the backend with timestamp",
        "All reviews are displayed in a scrollable list",
        "Star rating visually renders as filled/empty stars"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Build a Contact & Location page that displays: the restaurant's address, opening hours (e.g., Mon–Sun 11am–11pm), a static embedded Google Maps iframe for the restaurant location, a 'Call Us' button (tel: link), a 'WhatsApp' button (wa.me link), and an email address.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Contact & Location",
          "Google Maps integration",
          "Call & WhatsApp button",
          "Opening hours"
        ]
      },
      "acceptanceCriteria": [
        "Address and opening hours are displayed",
        "A Google Maps embed iframe shows the restaurant location",
        "Call button opens the phone dialer with the restaurant number",
        "WhatsApp button opens a WhatsApp chat link",
        "Page is accessible from the main navigation"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Build an Admin Panel page (protected by a hardcoded admin principal check in the backend). The admin panel must include three tabs: (1) Menu Management – add, edit, and delete dish records including uploading an image URL; (2) Order Management – view all orders, update order status; (3) Revenue Reports – display total orders count, total revenue, and a simple list of orders grouped by day.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Admin Panel",
          "Update menu",
          "Manage orders",
          "View revenue reports"
        ]
      },
      "acceptanceCriteria": [
        "Admin panel is only accessible to the designated admin principal",
        "Admin can create, edit, and delete menu items",
        "Admin can view all orders and change their status",
        "Revenue report tab shows total revenue and order counts",
        "Non-admin users see an access-denied message"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Generate and use custom images as static assets for: the restaurant logo (used on splash screen and nav), a hero banner for the Home screen, and representative dish images for each of the five menu categories.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Logo of The Swad Restaurant",
          "Featured dishes with images"
        ]
      },
      "acceptanceCriteria": [
        "Logo image is rendered on the splash screen and in the top navigation",
        "Hero banner image is displayed on the Home screen",
        "Each menu category has at least one representative dish image rendered from static assets"
      ]
    }
  ],
  "constraints": [
    "Authentication must use Internet Identity only — no third-party OAuth providers",
    "All backend logic must reside in a single Motoko actor (backend/main.mo)",
    "No external databases — all data stored in Motoko stable variables",
    "No real payment processing — payment method selection is UI-only with placeholder confirmation",
    "No real push notification service — notification UI should be simulated/static",
    "No WhatsApp or Google Maps API keys required — use static href links and iframe embeds",
    "Frontend immutable paths must not be modified"
  ],
  "nonGoals": [
    "Native Android or iOS app packaging (React web app only)",
    "Real-time WebSocket order tracking",
    "SMS or email notification delivery",
    "Actual payment gateway integration (Stripe, Razorpay, etc.)",
    "GPS-based delivery tracking",
    "Multi-language support (English only)"
  ],
  "imageRequirements": {
    "required": [
      "Circular restaurant logo with a decorative Indian mandala border, the letter 'S' in gold on a maroon background, and the words 'The Swad' in gold serif font below (swad-logo.dim_256x256.png)",
      "Wide hero banner showing a richly lit spread of authentic Indian dishes on a dark wooden table with warm saffron and gold lighting (hero-banner.dim_1200x480.png)",
      "Appetizing image of Indian starters — samosa, tikki, and kebab on a decorative plate with warm lighting (dish-starters.dim_600x400.png)",
      "Appetizing image of Indian main course dishes — butter chicken, dal makhani, and paneer tikka masala in copper serving bowls (dish-maincourse.dim_600x400.png)",
      "Appetizing image of Indian breads — naan, roti, and paratha arranged on a cloth with a small bowl of butter (dish-breads.dim_600x400.png)",
      "Appetizing image of Indian desserts — gulab jamun, kheer, and jalebi arranged on a gold-rimmed plate (dish-desserts.dim_600x400.png)",
      "Appetizing image of Indian beverages — mango lassi, masala chai, and rose sharbat in elegant glasses with garnish (dish-beverages.dim_600x400.png)"
    ],
    "edits": []
  }
}